In [12]:
import pandas as pd

In [13]:
# Series de pandas
numeros = [3, 4, 5, 6, 7]
serie = pd.Series(numeros)
serie, type(serie)

(0    3
 1    4
 2    5
 3    6
 4    7
 dtype: int64,
 pandas.core.series.Series)

In [14]:
data = {
    "Nombre":["Ana", "Juan", "Pedro", "Maria", "Luis"],
    "Edad":[22, 25, 28 ,23, 20],
    "Ciudad":["Barcelona", "Madrid", "Valencia", "Sevilla", "Bilboa"]
}
data, type(data)

({'Nombre': ['Ana', 'Juan', 'Pedro', 'Maria', 'Luis'],
  'Edad': [22, 25, 28, 23, 20],
  'Ciudad': ['Barcelona', 'Madrid', 'Valencia', 'Sevilla', 'Bilboa']},
 dict)

In [15]:
# Generar un dataframe a partir de un diccionario 

df = pd.DataFrame(data=data) 
df

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
1   Juan    25     Madrid
2  Pedro    28   Valencia
3  Maria    23    Sevilla
4   Luis    20     Bilboa

In [16]:
# exportar DataFrame 
df.to_csv("data.csv")

In [18]:
# importar un DataFrame
import_df = pd.read_csv("data.csv", index_col=0)
import_df

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
1   Juan    25     Madrid
2  Pedro    28   Valencia
3  Maria    23    Sevilla
4   Luis    20     Bilboa

In [19]:
# Seleccionar una columna
nombres = df["Nombre"]
print(nombres, type(nombres))

0      Ana
1     Juan
2    Pedro
3    Maria
4     Luis
Name: Nombre, dtype: object <class 'pandas.core.series.Series'>

In [20]:
# Seleccionar una o mas columnas 
df[["Nombre","Edad"]]

  Nombre  Edad
0    Ana    22
1   Juan    25
2  Pedro    28
3  Maria    23
4   Luis    20

In [21]:
# Filtrar por indice 
fila = df.loc[2]
fila

Nombre       Pedro
Edad            28
Ciudad    Valencia
Name: 2, dtype: object

In [22]:
# Filtrar por condiciones
df[df["Edad"] > 23]

  Nombre  Edad    Ciudad
1   Juan    25    Madrid
2  Pedro    28  Valencia

In [24]:
filtro = (df["Edad"] > 23) & (df["Nombre"].str.startswith("P"))
df[filtro]

  Nombre  Edad    Ciudad
2  Pedro    28  Valencia

In [26]:
# Filtrar por query
df.query("Edad < 23")

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
4   Luis    20     Bilboa

In [27]:
df[df["Nombre"].isin(["Ana", "Carlos", "Luis"])]

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
4   Luis    20     Bilboa

In [28]:
def longitud_5(nombre):
    return len(nombre) == 5

df[df["Nombre"].apply(longitud_5)]

  Nombre  Edad    Ciudad
2  Pedro    28  Valencia
3  Maria    23   Sevilla

In [29]:
# Filtrar por edades entre 25 y 35 años (inclusive)
df[df["Edad"].between(25, 35)]

  Nombre  Edad    Ciudad
1   Juan    25    Madrid
2  Pedro    28  Valencia

In [32]:
import numpy as np

In [35]:
data = {
    "Nombre":["Ana", "Juan", "Pedro", "Maria", "Luis"],
    "Edad":[22, 25, np.nan ,23, 20],
    "Ciudad":["Barcelona", "Madrid", "Valencia", None, "Bilboa"]
}
df = pd.DataFrame(data)
df

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
2  Pedro   NaN   Valencia
3  Maria  23.0       None
4   Luis  20.0     Bilboa

In [39]:
# Rellenar los valores faltantes
df_fill = df.fillna(
    {
        "Edad" : df["Edad"].mean(),
        "Ciudad" : "Desconocido"
    }
)
df_fill

  Nombre  Edad       Ciudad
0    Ana  22.0    Barcelona
1   Juan  25.0       Madrid
2  Pedro  22.5     Valencia
3  Maria  23.0  Desconocido
4   Luis  20.0       Bilboa

In [40]:
df_sin_nan = df.dropna()
df_sin_nan

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
4   Luis  20.0     Bilboa

In [42]:
# Reemplazar valores especificos de una columna
df_reem = df.replace(
    {
        "Ciudad" : {None:"Desconocido"}
    }
)
df_reem

  Nombre  Edad       Ciudad
0    Ana  22.0    Barcelona
1   Juan  25.0       Madrid
2  Pedro   NaN     Valencia
3  Maria  23.0  Desconocido
4   Luis  20.0       Bilboa

In [43]:
# Interpolar valores
df_interpolado = df.copy()
df_interpolado["Edad"] = df["Edad"].interpolate()
df_interpolado

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
2  Pedro  24.0   Valencia
3  Maria  23.0       None
4   Luis  20.0     Bilboa

In [47]:
data_duplicada = {
    "Nombre": ["Ana", "Juan", "Pedro", "Maria", "Luis", "Ana", "Juan"],
    "Edad" : [22, 25, np.nan, 23, 20, 22, 25],
    "Ciudad": ["Barcelona", "Madrid", "Valencia", None, "Bilbao", "Barcelona", "Madrid"]
}
df_duplicado = pd.DataFrame(data_duplicada)
df_duplicado

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
2  Pedro   NaN   Valencia
3  Maria  23.0       None
4   Luis  20.0     Bilbao
5    Ana  22.0  Barcelona
6   Juan  25.0     Madrid

In [48]:
df_sin_duplicados = df_duplicado.drop_duplicates()
df_sin_duplicados

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
2  Pedro   NaN   Valencia
3  Maria  23.0       None
4   Luis  20.0     Bilbao

In [49]:
# Renombrar columnas
df_renombrado = df.rename(columns={"Nombre":"Name", "Edad":"Age", "Ciudad":"City"})
df_renombrado

    Name   Age       City
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
2  Pedro   NaN   Valencia
3  Maria  23.0       None
4   Luis  20.0     Bilboa

In [50]:
# Ordenar columnas
columnas_ordenadas = ["Ciudad", "Edad", "Nombre"]
df_ordenado = df[columnas_ordenadas]
df_ordenado

      Ciudad  Edad Nombre
0  Barcelona  22.0    Ana
1     Madrid  25.0   Juan
2   Valencia   NaN  Pedro
3       None  23.0  Maria
4     Bilboa  20.0   Luis

In [51]:
# Transformacion de datos
def cuadrado(x):
    return x**2

df["Edad_Cuadrado"] = df["Edad"].apply(cuadrado)
df

  Nombre  Edad     Ciudad  Edad_Cuadrado
0    Ana  22.0  Barcelona          484.0
1   Juan  25.0     Madrid          625.0
2  Pedro   NaN   Valencia            NaN
3  Maria  23.0       None          529.0
4   Luis  20.0     Bilboa          400.0

In [53]:
data = {"Nombre" : ["Juan", "Ana", "Luis", "Laura", "Pedro", "Carla"],
        "Ciudad" : ["Madrid", "Barcelona", "Madrid", "Valencia", "Barcelona", "Madrid"],
        "Edad" : [25, 33, 30, 28, 45, 38],
        "Puntuacion" : [80, 90, 85, 88, 75, 91]    
    }
df = pd.DataFrame(data)
df

  Nombre     Ciudad  Edad  Puntuacion
0   Juan     Madrid    25          80
1    Ana  Barcelona    33          90
2   Luis     Madrid    30          85
3  Laura   Valencia    28          88
4  Pedro  Barcelona    45          75
5  Carla     Madrid    38          91

In [54]:
# Agrupar los datos por ciudad
grouped = df.groupby("Ciudad")
print(grouped.groups)

{'Barcelona': [1, 4], 'Madrid': [0, 2, 5], 'Valencia': [3]}

In [55]:
# Calcular la suma de las edades y puntuaciones por ciudad
aggregated_data = grouped.agg(
    {
        "Edad":"mean",
        "Puntuacion":"sum"
    }
)
aggregated_data

           Edad  Puntuacion
Ciudad
Barcelona  39.0         165
Madrid     31.0         256
Valencia   28.0          88

In [57]:
# Definir una funcion de agregacion personalizada
def rango(series):
    return series.max() - series.min()

# Aplicar la funcion agg per al grupo
aggregated_data_custom = grouped.agg(
    {
        "Edad":rango, 
        "Puntuacion":rango
    }
)
aggregated_data_custom

           Edad  Puntuacion
Ciudad
Barcelona    12          15
Madrid       13          11
Valencia      0           0

In [58]:
data["Categoria"] = ["A", "B", "A", "B", "A", "B"]
df = pd.DataFrame(data)
df

  Nombre     Ciudad  Edad  Puntuacion Categoria
0   Juan     Madrid    25          80         A
1    Ana  Barcelona    33          90         B
2   Luis     Madrid    30          85         A
3  Laura   Valencia    28          88         B
4  Pedro  Barcelona    45          75         A
5  Carla     Madrid    38          91         B

In [59]:
# Agrupar datos por ciudad y categoria
grouped_multi = df.groupby(["Ciudad", "Categoria"])
grouped_multi.groups

{('Barcelona', 'A'): [4], ('Barcelona', 'B'): [1], ('Madrid', 'A'): [0, 2], ('Madrid', 'B'): [5], ('Valencia', 'B'): [3]}

In [60]:
# Calcular la duma de las edades y puntuacion por Ciudad y por Categoria
aggregated_data_multi = grouped_multi.agg(
    {
        "Edad":"sum",
        "Puntuacion":"sum"
    }
)
aggregated_data_multi

                     Edad  Puntuacion
Ciudad    Categoria
Barcelona A            45          75
          B            33          90
Madrid    A            55         165
          B            38          91
Valencia  B            28          88

In [66]:
# Crear un DataFrame de ejemplo
data = {"Nombre": ["Juan", "Ana", "Luis", "Laura"],
"Edad": [25, 33, 30, 28]}
df = pd.DataFrame(data)
df

  Nombre  Edad
0   Juan    25
1    Ana    33
2   Luis    30
3  Laura    28

In [62]:
# Agregar una columna
df["Ciudad"] = ["Madrid", "Barcelona", "Madrid", "Valencia"]
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1    Ana    33  Barcelona
2   Luis    30     Madrid
3  Laura    28   Valencia

In [64]:
# Generamos una nueva fila
new_row = pd.Series({"Nombre":"Pedro", "Edad":45, "Ciudad": "Barcelona"})

# Agregamos fila al DataFrame
df = pd.concat([df, new_row.to_frame().T], ignore_index=True)
df

  Nombre Edad     Ciudad
0   Juan   25     Madrid
1    Ana   33  Barcelona
2   Luis   30     Madrid
3  Laura   28   Valencia
4  Pedro   45  Barcelona
5  Pedro   45  Barcelona

In [72]:
# Crear un DataFrame de ejemplo
data = {"Nombre": ["Juan", "Ana", "Luis", "Laura"],
"Edad": [25, 33, 30, 28]}
df1 = pd.DataFrame(data)
df1["Ciudad"] = ["Madrid", "Barcelona", "Madrid", "Valencia"]

# Crear un segundo DataFrame de ejemplo
data2 = {"Nombre": ["Carla", "Irene"],
             "Edad": [38, 27],
             "Ciudad": ["Madrid", "Bilbao"]}
df2 = pd.DataFrame(data2)

In [73]:
df1

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1    Ana    33  Barcelona
2   Luis    30     Madrid
3  Laura    28   Valencia

In [71]:
df2

  Nombre  Edad  Ciudad
0  Carla    38  Madrid
1  Irene    27  Bilbao

In [74]:
df_combined = pd.concat([df1, df2], ignore_index =True)
df_combined

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1    Ana    33  Barcelona
2   Luis    30     Madrid
3  Laura    28   Valencia
4  Carla    38     Madrid
5  Irene    27     Bilbao

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Crear un arreglo de numpy
data = np.array([[1,2,3], [4,5,6], [7,8,9]])

# Crear un DataFrame a partir del arreglo de Numpy
df = pd.DataFrame(data, columns=["A", "B", "C"])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [3]:
data = {
    "A": [1,4,7],
    "B": [2,5,8],
    "C": [3,6,9]
}
df = pd.DataFrame(data)
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
# Convertir un DataFrame a un array de Numpy
arr = df.to_numpy()
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]], dtype=int64)

In [5]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]], dtype=int64)

In [14]:
# Calcular el promedio de cada columna utilizando Numpy
mean_columns = np.mean(df, axis=0)
mean_columns

A    4.0
B    5.0
C    6.0
dtype: float64

In [15]:
df.mean(axis=0)

A    4.0
B    5.0
C    6.0
dtype: float64

In [16]:
df.mean(axis=1)

0    2.0
1    5.0
2    8.0
dtype: float64